[
   {
      "from": "support@trustedbank.com",
      "subject": "Your account security has been updated",
      "body": "Dear customer, we have recently updated our security protocols to ensure your account remains safe. Please review the changes and contact us if you notice any unusual activity.\n\nThank you for trusting us with your financial security. If you did not initiate this change, please secure your account immediately."
   },
   {
      "from": "no-reply@netflixsubscription.com",
      "subject": "Your subscription payment failed",
      "body": "We were unable to process your last payment for your Netflix subscription. Please update your payment method to avoid service interruption.\n\nIf you believe this is an error, you can ignore this message or contact customer support for assistance."
   },
   {
      "from": "billing@premiumsoftware.com",
      "subject": "Invoice for your recent purchase",
      "body": "Thank you for your recent purchase! Your invoice is attached for your records. Please ensure the payment is processed within the next 5 business days.\n\nIf you have any questions regarding your invoice, feel free to reply to this email."
   },
   {
      "from": "noreply@socialnetwork.site",
      "subject": "New login detected from a different device",
      "body": "We noticed a new login to your account from an unrecognized device. If this was you, no further action is needed.\n\nIf you did not authorize this login, please secure your account immediately by changing your password."
   },
   {
      "from": "team@onlinegamingplatform.com",
      "subject": "Your gaming rewards are about to expire",
      "body": "Your accumulated gaming rewards will expire in 7 days. Log in to claim them before they're gone!\n\nDon't miss out on exclusive in-game items and bonuses. Visit our platform now to redeem your rewards."
   },
   {
      "from": "support@cloudstorage.com",
      "subject": "Your storage is almost full",
      "body": "Your cloud storage is currently at 90% capacity. Upgrade now to avoid service interruptions and keep your files safe.\n\nWe offer flexible plans to suit your needs. Click below to explore your options."
   },
   {
      "from": "hello@fitnessapp.com",
      "subject": "New workout plan tailored for you",
      "body": "We've created a personalized workout plan based on your recent activity. Check it out and start your fitness journey today!\n\nStay motivated and track your progress with our advanced analytics."
   },
   {
      "from": "no-reply@traveldeals.com",
      "subject": "Exclusive flight discounts just for you",
      "body": "As a valued member, we're offering you exclusive flight discounts to your favorite destinations. Book now before the offer expires!\n\nPack your bags and get ready for an unforgettable adventure."
   },
   {
      "from": "support@smart-home.com",
      "subject": "Firmware update available for your device",
      "body": "A new firmware update is available for your smart home device. Update now to enjoy improved performance and new features.\n\nEnsure your device is connected to Wi-Fi during the update process."
   },
   {
      "from": "newsletter@technews.org",
      "subject": "This week's top tech stories you shouldn't miss",
      "body": "Stay updated with the latest in technology. Here are the top stories from this week that you might find interesting.\n\nFrom AI advancements to new gadget releases, we've got you covered."
   },
   {
      "from": "orders@onlinestore.com",
      "subject": "Your order has been shipped",
      "body": "Great news! Your recent order has been shipped and is on its way to you. Track your package using the link below.\n\nThank you for shopping with us. We hope you enjoy your purchase!"
   },
   {
      "from": "support@musicstreaming.com",
      "subject": "New playlist curated based on your taste",
      "body": "We've created a new playlist just for you, featuring songs we think you'll love. Start listening now!\n\nDiscover new music tailored to your preferences every week."
   },
   {
      "from": "no-reply@jobportal.com",
      "subject": "New job opportunities matching your profile",
      "body": "We found several job openings that match your skills and experience. Apply now to take the next step in your career.\n\nDon't miss out on these exciting opportunities tailored just for you."
   },
   {
      "from": "billing@webhosting.com",
      "subject": "Your hosting plan renewal is due soon",
      "body": "Your web hosting plan is set to renew automatically in 10 days. Review your plan details and payment method to ensure uninterrupted service.\n\nIf you wish to make any changes, please log in to your account."
   },
   {
      "from": "support@cryptowallet.com",
      "subject": "Important security alert for your wallet",
      "body": "We detected an unusual login attempt on your crypto wallet. Secure your account immediately by changing your password.\n\nIf this was you, no further action is required. Stay safe!"
   },
   {
      "from": "team@onlinelearning.com",
      "subject": "New course available in your preferred category",
      "body": "We've added a new course that aligns with your interests. Enroll now to start learning at your own pace.\n\nExpand your knowledge with our expert-led courses today."
   },
   {
      "from": "no-reply@healthinsurance.com",
      "subject": "Your policy documents are ready for download",
      "body": "Your health insurance policy documents are now available. Download them for your records and review the coverage details.\n\nIf you have any questions, our customer support team is here to help."
   },
   {
      "from": "support@smartwatch.com",
      "subject": "New features unlocked in your latest update",
      "body": "Your recent smartwatch update includes exciting new features. Explore them now to enhance your experience.\n\nFrom fitness tracking to notifications, make the most of your device."
   },
   {
      "from": "newsletter@investing.com",
      "subject": "Market trends and investment opportunities this week",
      "body": "Stay ahead with the latest market trends and potential investment opportunities. Here's what you need to know this week.\n\nMake informed decisions with our expert analysis."
   },
   {
      "from": "no-reply@fooddelivery.com",
      "subject": "Special discount on your next order",
      "body": "Enjoy 20% off your next food delivery order. Use the promo code before it expires!\n\nTreat yourself to delicious meals from your favorite restaurants."
   },
   {
      "from": "support@passwordmanager.com",
      "subject": "Reminder: Secure your passwords regularly",
      "body": "It's been a while since you last updated your passwords. For better security, consider changing them soon.\n\nUse our built-in password generator for strong and unique passwords."
   },
   {
      "from": "team@onlineauction.com",
      "subject": "You've been outbid on your favorite item",
      "body": "Someone just placed a higher bid on the item you're watching. Don't miss out—place your counterbid now!\n\nHurry, the auction is ending soon."
   },
   {
      "from": "no-reply@carrental.com",
      "subject": "Your upcoming reservation details",
      "body": "Here are the details for your upcoming car rental. Review them carefully and contact us if you have any questions.\n\nWe look forward to serving you and wish you a safe trip."
   },
   {
      "from": "support@home-security.com",
      "subject": "Motion detected in your backyard",
      "body": "Your home security system detected motion in your backyard. Check the live feed or review the recorded clip.\n\nIf this was unexpected, ensure your property is secure."
   },
   {
      "from": "newsletter@booklovers.com",
      "subject": "New releases in your favorite genre this month",
      "body": "Discover the hottest new book releases in your preferred genre. Find your next great read today!\n\nHappy reading from all of us at BookLovers."
   },
   {
      "from": "no-reply@eventtickets.com",
      "subject": "Your concert tickets are attached",
      "body": "Your e-tickets for the upcoming concert are attached. Save them or print them out for entry.\n\nGet ready for an amazing night of music and fun!"
   },
   {
      "from": "support@fitness-tracker.com",
      "subject": "Weekly fitness report and insights",
      "body": "Here's your weekly fitness report. See your progress and get personalized tips to improve your workouts.\n\nKeep up the great work and stay motivated!"
   },
   {
      "from": "team@crowdfunding.com",
      "subject": "Your backed project has reached its goal",
      "body": "Great news! The project you supported has successfully reached its funding goal. Thank you for your contribution.\n\nStay tuned for updates from the creators."
   },
   {
      "from": "no-reply@realestate.com",
      "subject": "New property listings matching your criteria",
      "body": "We found several properties that match your search criteria. Take a look and schedule a viewing.\n\nYour dream home might be just a click away."
   },
   {
      "from": "support@language-learning.com",
      "subject": "Your daily vocabulary challenge",
      "body": "Here’s your daily vocabulary challenge to help you learn faster. Practice these words and track your progress.\n\nConsistency is key to mastering a new language."
   },
   {
      "from": "billing@vpn-service.com",
      "subject": "Your subscription is expiring soon",
      "body": "Your VPN subscription will expire in 7 days. Renew now to continue enjoying secure and private browsing.\n\nDon’t risk your online privacy—stay protected."
   },
   {
      "from": "no-reply@charity.org",
      "subject": "Your donation made a difference",
      "body": "Thanks to your generous donation, we’ve been able to make a real impact. Here’s how your contribution helped.\n\nThank you for supporting our cause."
   },
   {
      "from": "support@smartthermostat.com",
      "subject": "Energy-saving tips for this season",
      "body": "With the changing weather, here are some tips to optimize your smart thermostat for energy savings.\n\nReduce your bills while staying comfortable at home."
   },
   {
      "from": "team@stocktrading.com",
      "subject": "Market volatility alert: Protect your investments",
      "body": "Due to recent market volatility, consider reviewing your portfolio and adjusting your strategy if needed.\n\nStay informed and make smart investment decisions."
   },
   {
      "from": "no-reply@datingapp.com",
      "subject": "New matches waiting for your response",
      "body": "You have new potential matches who are interested in connecting. Don’t keep them waiting—reply now!\n\nYour next great connection could be just a message away."
   },
   {
      "from": "support@homecleaning.com",
      "subject": "Your cleaning appointment confirmation",
      "body": "Your upcoming cleaning appointment has been confirmed. We’ll see you at the scheduled time.\n\nEnjoy a spotless home without the hassle."
   },
   {
      "from": "newsletter@petcare.com",
      "subject": "Tips to keep your pet healthy this season",
      "body": "Seasonal changes can affect your pet’s health. Here are some tips to keep them happy and healthy.\n\nYour furry friend deserves the best care."
   },
   {
      "from": "no-reply@freelanceplatform.com",
      "subject": "New project proposal received",
      "body": "A client has sent you a new project proposal. Review the details and respond to secure the job.\n\nGrow your freelance career with exciting opportunities."
   },
   {
      "from": "support@bike-rental.com",
      "subject": "Your rental period is ending soon",
      "body": "Your bike rental period is about to expire. Return the bike on time to avoid additional charges.\n\nThank you for choosing our service."
   },
   {
      "from": "team@ai-newsletter.com",
      "subject": "Breakthroughs in AI you should know about",
      "body": "The world of AI is evolving rapidly. Here are the latest breakthroughs and what they mean for the future.\n\nStay ahead with cutting-edge insights."
   },
   {
      "from": "no-reply@luxury-watches.com",
      "subject": "Exclusive limited-time offer on premium watches",
      "body": "As a valued customer, enjoy an exclusive discount on our premium watch collection. Shop now before stocks run out.\n\nElevate your style with timeless elegance."
   },
   {
      "from": "support@smart-lighting.com",
      "subject": "New lighting presets available for your home",
      "body": "We’ve added new smart lighting presets to enhance your home ambiance. Try them out today!\n\nCreate the perfect mood with just a tap."
   },
   {
      "from": "newsletter@outdoor-gear.com",
      "subject": "Essential gear for your next adventure",
      "body": "Planning an outdoor trip? Here’s a list of must-have gear to ensure a safe and enjoyable experience.\n\nGet ready to explore the great outdoors."
   },
   {
      "from": "no-reply@online-pharmacy.com",
      "subject": "Your prescription refill reminder",
      "body": "It’s time to refill your prescription. Order now to avoid running out of your medication.\n\nYour health is our priority."
   },
   {
      "from": "support@virtual-reality.com",
      "subject": "New VR games released this week",
      "body": "Immerse yourself in the latest virtual reality games. Check out the new releases and start playing!\n\nThe future of gaming is here."
   },
   {
      "from": "team@organic-food.com",
      "subject": "Seasonal organic produce now available",
      "body": "Fresh, seasonal organic produce is now in stock. Order now for delivery straight to your door.\n\nEat healthy and support sustainable farming."
   },
   {
      "from": "no-reply@car-sharing.com",
      "subject": "Your ride summary and invoice",
      "body": "Here’s the summary of your recent ride along with the invoice. Thank you for choosing our service.\n\nWe hope to see you again soon."
   },
   {
      "from": "support@smart-plug.com",
      "subject": "Maximize your smart plug’s potential",
      "body": "Learn how to get the most out of your smart plug with these useful tips and automation ideas.\n\nMake your home smarter and more efficient."
   },
   {
      "from": "newsletter@photography.com",
      "subject": "Photography tips to improve your skills",
      "body": "Whether you’re a beginner or a pro, these photography tips will help you capture stunning images.\n\nKeep shooting and refining your craft."
   },
   {
      "from": "no-reply@online-consultation.com",
      "subject": "Your upcoming doctor’s appointment reminder",
      "body": "This is a reminder for your scheduled online consultation. Ensure you’re available at the appointed time.\n\nTake care of your health with ease."
   }
]
